FV2304/E_0450.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">GPKE</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">6.28.2: AD: Information über die Beendigung der Zuordnung einer Marktlokation zur Datenaggregation durch den ÜNB</FONT></B><BR/><BR/><BR/><BR/>>;
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_0450</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> ÜNB</B></FONT><BR align="center"/>>];
    "1" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>1: </B>Sind Fehler im Rahmen der AHB-Prüfungen in den Stammdaten des NB festgestellt worden?<BR align="left"/>>];
    "A97" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A97</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Die Stammdaten des NB genügen nicht den AHB-Vorgaben.<BR align="left"/>Hinweis: Diese Prüfung ist auf alle Stammdaten des NB anzuwenden. Es sind die Fehlerorte aller dabei festgestellten Fehler in der Antwort zu benennen.<BR align="left"/>Eine Durchführung der nachfolgend in diesem EBD genannten Prüfungen erfolgt nicht.<BR align="left"/></FONT>>];
    "2" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>2: </B>Wechselt für die Marktlokation die Aggregationsverantwortung vom ÜNB zum NB?<BR align="left"/>>];
    "3" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>3: </B>Ist die Marktlokation zu dem im Vorgang unter „Verwendung der Daten bis“ genannten Zeitpunkt dem ÜNB zur Datenaggregation zugeordnet?<BR align="left"/>>];
    "A02" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A02</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Die Marktlokation bzw. Tranche ist zum genannten Zeitpunkt nicht dem ÜNB zur Aggregation zugeordnet<BR align="left"/></FONT>>];
    "4" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>4: </B>Liegt eine Stilllegung der Marktlokation vor?<BR align="left"/>>];
    "5" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>5: </B>Ist die Marktlokation zu dem im Vorgang unter „Verwendung der Daten bis“ genannten Zeitpunkt dem ÜNB bekannt?<BR align="left"/>>];
    "A03" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A03</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Die Marktlokation bzw. Tranche ist zu dem im Vorgang unter „Verwendung der Daten bis“ genannten Zeitpunkt dem ÜNB nicht bekannt<BR align="left"/></FONT>>];
    "6" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>6: </B>Ist die Marktlokation zu dem im Vorgang unter „Verwendung der Daten bis“ genannten Zeitpunkt dem NB zur Datenaggregation zugeordnet?<BR align="left"/>>];
    "A04" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A04</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Die Marktlokation bzw. Tranche ist zum genannten Zeitpunkt nicht dem NB zur Aggregation zugeordnet<BR align="left"/></FONT>>];
    "7" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>7: </B>Liegt die Marktlokation zu dem im Vorgang unter „Verwendung der Daten bis“ genannten Zeitpunkt dem ÜNB mit dem Bilanzierungsverfahren Bilanzierung auf Basis von Viertelstundenwerten vor?<BR align="left"/>>];
    "A05" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A05</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Die Marktlokation bzw. Tranche liegt zum genannten Zeitpunkt dem ÜNB nicht mit dem Bilanzierungsverfahren Bilanzierung auf Basis von Viertelstundenwerten vor<BR align="left"/></FONT>>];
    "8" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>8: </B>Ist die Marktlokation zu dem im Vorgang unter „Verwendung der Daten bis“ genannten Zeitpunkt dem im Vorgang angegebenen Netzbetreiber zugeordnet?<BR align="left"/>>];
    "A06" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A06</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Angegebener Netzbetreiber ist zum angegebenen Zeitpunkt der Marktlokation bzw. Tranche nicht zugeordnet<BR align="left"/></FONT>>];
    "9" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>9: </B>Ist der im Vorgang genannte LF identisch mit dem Absender der Nachricht?<BR align="left"/>>];
    "A07" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A07</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>LF im Vorgang weicht vom Absender ab<BR align="left"/></FONT>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>10: </B>Ist ein nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>];
    "A99" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A99</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Ablehnung Sonstiges<BR align="left"/>Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben / benennen.<BR align="left"/>Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr<BR align="left"/></FONT>>];
    "A01" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A01</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Stammdaten wurden widerspruchsfrei übernommen.<BR align="left"/></FONT>>];

    "Start" -> "1";
    "1" -> "A97" [label="Ja"];
    "1" -> "2" [label="Nein"];
    "2" -> "3" [label="Ja"];
    "2" -> "4" [label="Nein"];
    "3" -> "A02" [label="Nein"];
    "3" -> "8" [label="Ja"];
    "4" -> "5" [label="Ja"];
    "4" -> "6" [label="Nein"];
    "5" -> "A03" [label="Nein"];
    "5" -> "8" [label="Ja"];
    "6" -> "A04" [label="Nein"];
    "6" -> "7" [label="Ja"];
    "7" -> "A05" [label="Nein"];
    "7" -> "8" [label="Ja"];
    "8" -> "A06" [label="Nein"];
    "8" -> "9" [label="Ja"];
    "9" -> "A07" [label="Nein"];
    "9" -> "10" [label="Ja"];
    "10" -> "A99" [label="Ja"];
    "10" -> "A01" [label="Nein"];

    bgcolor="transparent";
}
