FV2304/E_0450.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

title
GPKE

6.28.2: AD: Information über die Beendigung der Zuordnung einer Marktlokation zur Datenaggregation durch den ÜNB



end title
:<b>E_0450</b>;
note right
<b><i>Prüfende Rolle: ÜNB
end note

if (<b>1: </b> Sind Fehler im Rahmen der AHB-Prüfungen in den Stammdaten des NB festgestellt worden?) then (ja)
    :A97;
    note left
        Die Stammdaten des NB genügen nicht den AHB-Vorgaben.
        Hinweis: Diese Prüfung ist auf alle Stammdaten des NB anzuwenden. Es sind die Fehlerorte aller dabei festgestellten Fehler in der Antwort zu benennen.
        Eine Durchführung der nachfolgend in diesem EBD genannten Prüfungen erfolgt nicht.
    endnote
    kill;
else (nein)
endif
if (<b>2: </b> Wechselt für die Marktlokation die Aggregationsverantwortung vom ÜNB zum NB?) then (ja)
    if (<b>3: </b> Ist die Marktlokation zu dem im Vorgang unter „Verwendung der Daten bis“ genannten Zeitpunkt dem ÜNB zur Datenaggregation zugeordnet?) then (ja)
    else (nein)
        :A02;
        note left
            Die Marktlokation bzw. Tranche ist zum genannten Zeitpunkt nicht dem ÜNB zur Aggregation zugeordnet
        endnote
        kill;
    endif
    if (<b>8: </b> Ist die Marktlokation zu dem im Vorgang unter „Verwendung der Daten bis“ genannten Zeitpunkt dem im Vorgang angegebenen Netzbetreiber zugeordnet?) then (ja)
    else (nein)
        :A06;
        note left
            Angegebener Netzbetreiber ist zum angegebenen Zeitpunkt der Marktlokation bzw. Tranche nicht zugeordnet
        endnote
        kill;
    endif
    if (<b>9: </b> Ist der im Vorgang genannte LF identisch mit dem Absender der Nachricht?) then (ja)
    else (nein)
        :A07;
        note left
            LF im Vorgang weicht vom Absender ab
        endnote
        kill;
    endif
    if (<b>10: </b> Ist ein nicht spezifizierter Fehler aufgetreten?) then (ja)
        :A99;
        note left
            Ablehnung Sonstiges
            Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben / benennen.
            Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
        endnote
        kill;
    else (nein)
        :A01;
        note left
            Stammdaten wurden widerspruchsfrei übernommen.
        endnote
        kill;
    endif
else (nein)
    if (<b>4: </b> Liegt eine Stilllegung der Marktlokation vor?) then (ja)
        if (<b>5: </b> Ist die Marktlokation zu dem im Vorgang unter „Verwendung der Daten bis“ genannten Zeitpunkt dem ÜNB bekannt?) then (ja)
        else (nein)
            :A03;
            note left
                Die Marktlokation bzw. Tranche ist zu dem im Vorgang unter „Verwendung der Daten bis“ genannten Zeitpunkt dem ÜNB nicht bekannt
            endnote
            kill;
        endif
        if (<b>8: </b> Ist die Marktlokation zu dem im Vorgang unter „Verwendung der Daten bis“ genannten Zeitpunkt dem im Vorgang angegebenen Netzbetreiber zugeordnet?) then (ja)
        else (nein)
            :A06;
            note left
                Angegebener Netzbetreiber ist zum angegebenen Zeitpunkt der Marktlokation bzw. Tranche nicht zugeordnet
            endnote
            kill;
        endif
        if (<b>9: </b> Ist der im Vorgang genannte LF identisch mit dem Absender der Nachricht?) then (ja)
        else (nein)
            :A07;
            note left
                LF im Vorgang weicht vom Absender ab
            endnote
            kill;
        endif
        if (<b>10: </b> Ist ein nicht spezifizierter Fehler aufgetreten?) then (ja)
            :A99;
            note left
                Ablehnung Sonstiges
                Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben / benennen.
                Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
            endnote
            kill;
        else (nein)
            :A01;
            note left
                Stammdaten wurden widerspruchsfrei übernommen.
            endnote
            kill;
        endif
    else (nein)
        if (<b>6: </b> Ist die Marktlokation zu dem im Vorgang unter „Verwendung der Daten bis“ genannten Zeitpunkt dem NB zur Datenaggregation zugeordnet?) then (ja)
        else (nein)
            :A04;
            note left
                Die Marktlokation bzw. Tranche ist zum genannten Zeitpunkt nicht dem NB zur Aggregation zugeordnet
            endnote
            kill;
        endif
        if (<b>7: </b> Liegt die Marktlokation zu dem im Vorgang unter „Verwendung der Daten bis“ genannten Zeitpunkt dem ÜNB mit dem Bilanzierungsverfahren Bilanzierung auf Basis von Viertelstundenwerten vor?) then (ja)
        else (nein)
            :A05;
            note left
                Die Marktlokation bzw. Tranche liegt zum genannten Zeitpunkt dem ÜNB nicht mit dem Bilanzierungsverfahren Bilanzierung auf Basis von Viertelstundenwerten vor
            endnote
            kill;
        endif
        if (<b>8: </b> Ist die Marktlokation zu dem im Vorgang unter „Verwendung der Daten bis“ genannten Zeitpunkt dem im Vorgang angegebenen Netzbetreiber zugeordnet?) then (ja)
        else (nein)
            :A06;
            note left
                Angegebener Netzbetreiber ist zum angegebenen Zeitpunkt der Marktlokation bzw. Tranche nicht zugeordnet
            endnote
            kill;
        endif
        if (<b>9: </b> Ist der im Vorgang genannte LF identisch mit dem Absender der Nachricht?) then (ja)
        else (nein)
            :A07;
            note left
                LF im Vorgang weicht vom Absender ab
            endnote
            kill;
        endif
        if (<b>10: </b> Ist ein nicht spezifizierter Fehler aufgetreten?) then (ja)
            :A99;
            note left
                Ablehnung Sonstiges
                Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben / benennen.
                Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
            endnote
            kill;
        else (nein)
            :A01;
            note left
                Stammdaten wurden widerspruchsfrei übernommen.
            endnote
            kill;
        endif
    endif
endif
if (<b>8: </b> Ist die Marktlokation zu dem im Vorgang unter „Verwendung der Daten bis“ genannten Zeitpunkt dem im Vorgang angegebenen Netzbetreiber zugeordnet?) then (ja)
else (nein)
    :A06;
    note left
        Angegebener Netzbetreiber ist zum angegebenen Zeitpunkt der Marktlokation bzw. Tranche nicht zugeordnet
    endnote
    kill;
endif
if (<b>9: </b> Ist der im Vorgang genannte LF identisch mit dem Absender der Nachricht?) then (ja)
else (nein)
    :A07;
    note left
        LF im Vorgang weicht vom Absender ab
    endnote
    kill;
endif
if (<b>10: </b> Ist ein nicht spezifizierter Fehler aufgetreten?) then (ja)
    :A99;
    note left
        Ablehnung Sonstiges
        Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben / benennen.
        Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
    endnote
    kill;
else (nein)
    :A01;
    note left
        Stammdaten wurden widerspruchsfrei übernommen.
    endnote
    kill;
endif

@enduml
